In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame([['Jay',16,'BBA'],
                  ['Jack',19,'BTech'],
                  ['Mark',18,'BSc']],
                 columns = ['Name','Age','Course'])
df

   Name  Age Course
0   Jay   16    BBA
1  Jack   19  BTech
2  Mark   18    BSc

In [5]:
js = df.to_json(orient = 'columns')
js

'{"Name":{"0":"Jay","1":"Jack","2":"Mark"},"Age":{"0":16,"1":19,"2":18},"Course":{"0":"BBA","1":"BTech","2":"BSc"}}'

In [6]:
js = df.to_json(orient = 'records')
js

'[{"Name":"Jay","Age":16,"Course":"BBA"},{"Name":"Jack","Age":19,"Course":"BTech"},{"Name":"Mark","Age":18,"Course":"BSc"}]'

In [7]:
df.to_json('./foo.json', orient='records')

In [9]:
df2 = pd.read_json('./foo.json')
df2

   Name  Age Course
0   Jay   16    BBA
1  Jack   19  BTech
2  Mark   18    BSc

In [16]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.461750  0.501343 -2.259684 -0.234963
2013-01-02  0.536499 -1.520555  0.515677 -0.004950
2013-01-03  0.460197  0.704460  0.361484 -0.236023
2013-01-04 -1.354538  1.077045  0.085262  0.227537
2013-01-05 -1.241267  0.587748 -0.747711 -1.817846
2013-01-06 -1.331997  0.910976 -0.341267 -1.386159

In [17]:
df['AA'] = list('ABCDEF')
df

                   A         B         C         D AA
2013-01-01 -0.461750  0.501343 -2.259684 -0.234963  A
2013-01-02  0.536499 -1.520555  0.515677 -0.004950  B
2013-01-03  0.460197  0.704460  0.361484 -0.236023  C
2013-01-04 -1.354538  1.077045  0.085262  0.227537  D
2013-01-05 -1.241267  0.587748 -0.747711 -1.817846  E
2013-01-06 -1.331997  0.910976 -0.341267 -1.386159  F

In [19]:
df.insert(0, 'NAME', ['HELLO', 'WORLD', np.nan] * 2)

ValueError: cannot insert NAME, already exists

In [20]:
df

             NAME         A         B         C         D AA
2013-01-01  HELLO -0.461750  0.501343 -2.259684 -0.234963  A
2013-01-02  WORLD  0.536499 -1.520555  0.515677 -0.004950  B
2013-01-03    NaN  0.460197  0.704460  0.361484 -0.236023  C
2013-01-04  HELLO -1.354538  1.077045  0.085262  0.227537  D
2013-01-05  WORLD -1.241267  0.587748 -0.747711 -1.817846  E
2013-01-06    NaN -1.331997  0.910976 -0.341267 -1.386159  F

In [21]:
df.insert(1, 'I_FLAG', np.nan)
df

             NAME  I_FLAG         A         B         C         D AA
2013-01-01  HELLO     NaN -0.461750  0.501343 -2.259684 -0.234963  A
2013-01-02  WORLD     NaN  0.536499 -1.520555  0.515677 -0.004950  B
2013-01-03    NaN     NaN  0.460197  0.704460  0.361484 -0.236023  C
2013-01-04  HELLO     NaN -1.354538  1.077045  0.085262  0.227537  D
2013-01-05  WORLD     NaN -1.241267  0.587748 -0.747711 -1.817846  E
2013-01-06    NaN     NaN -1.331997  0.910976 -0.341267 -1.386159  F

In [26]:
print(df['NAME'].isnull().sum()) # 2
df['NAME'].value_counts()

2

WORLD    2
HELLO    2
Name: NAME, dtype: int64

In [27]:
df.query("NAME == 'HELLO'")

             NAME  I_FLAG         A         B         C         D AA
2013-01-01  HELLO     NaN -0.461750  0.501343 -2.259684 -0.234963  A
2013-01-04  HELLO     NaN -1.354538  1.077045  0.085262  0.227537  D

In [29]:
# df.query 로 선택을 못한다.
df[df.query("NAME == 'HELLO'")]['I_FLAG'] = 'G'

ValueError: Boolean array expected for the condition, not object